export const auth = {
  signIn: {
    title: "Войти в аккаунт",
    subtitle: "Введите почту и пароль",
    button: "Войти",
    link: "Создать аккаунт",
  },

  signUp: {
    title: "Создать аккаунт",
    subtitle: "Информация для регистрации имя, адрес электронной почты и пароль",
    button: "Зарегестрироваться",
    link: "Уже есть аккаунт ?",
  },

  verification: {
    title: "Верификация аккаунта прошла успешно!",
  },

  confirmation: {
    title: "Верификация аккаунта",
    subtitle: "Теперь вы можете продолжать пользоваться нашим сервисом без каких-либо ограничений"
  },

  alert: {
    title: "Верификация учетной записи",
    subtitle: "Пожалуйста, проверьте свой адрес электронной почты на наличие ссылки для подтверждения",
    button: "Отправить снова",
  },

  passwordRecovery: {
    form: {
      title: 'Сброс Пароля',
      button: 'Отправить ссылку для сброса',
      input: 'Почта'
    },

    alert: {
      title: 'Письмо для сброса пароля отправлено',
      alert: 'Инструкции по сбросу пароля отправлены. Проверьте свою электронную почту или папку со спамом, если письмо не получено.'
    },

    reset: {
      title: 'Установить новый пароль',
      password: 'Новый пароль',
      repeat: 'Повторите пароль',
      button: 'Сброс пароля'
    }
  },

  continue: "Продолжить",
  loading: "Загрузка ...",


  namePlaceholder: "Имя",
  emailPlaceholder: "Почта",
  passwordPlaceholder: "Пароль",
  repeatPlaceholder: "Повторите пароль",
}