export const auth = {
  signIn: {
    title: "Войти в аккаунт",
    subtitle: "Введите почту и пароль",
    button: "Войти",
    link: "Создать аккаунт",
  },

  signUp: {
    title: "Создать аккаунт",
    subtitle: "Информация для регистрации имя, адрес электронной почты и пароль",
    button: "Зарегестрироваться",
    link: "Уже есть аккаунт ?",
  },

  verification: {
    title: "Верификация аккаунта прошла успешна!",
  },

  confirmation: {
    title: "Верификация аккаунта",
    subtitle: "Теперь вы можете продолжать пользоваться нашем сервисом без каких-либо ограничений"
  },

  alert: {
    title: "Верификация учетной записи",
    subtitle: "Пожалуйста, проверьте свой адрес электронной почты на наличие ссылки для подтверждения",
    button: "Отправить сново",
  },

  continue: "Продолжить",
  loading: "Загрузка ...",
  notValid: "Пароль или логин не валиден",


  namePlaceholder: "Имя",
  emailPlaceholder: "Почта",
  passwordPlaceholder: "Пароль",
  repeatPlaceholder: "Повторите пароль",
}